In [3]:
import pandas as pd
import constants

In [3]:
with constants.postgres_engine.connect() as conn:
    locations = pd.read_sql(f"SELECT site_code from locations", con=conn)
locations

    site_code
0        0n0e
1       0n10w
2      0n110w
3      0n125w
4      0n137e
..        ...
96       NTAS
97    Stratus
98      WHOTS
99    32n145e
100   50n145w

[101 rows x 1 columns]

In [4]:
with constants.postgres_engine.connect() as conn:
    nobslocs = pd.read_sql(f"SELECT DISTINCT site_code from nobs", con=conn)
nobslocs

    site_code
0      12s67e
1        6s8e
2      8n110w
3      8n156e
4      0n125w
..        ...
96     12n38w
97     12s55e
98      8s95w
99    25s100e
100     0n95w

[101 rows x 1 columns]

In [5]:
with constants.postgres_engine.connect() as conn:
    times = pd.read_sql(f'SELECT MIN(start_date_seconds), MAX(end_date_seconds) from metadata', con=conn)
times['min'].values[0], times['max'].values[0]

(866718000.0, 1645722000.0)

In [12]:
with constants.postgres_engine.connect() as conn:
    dids = pd.read_sql(f"SELECT DISTINCT did from variables WHERE short_name='TAUX' or short_name='TAUY'", con=conn)
list(dids['did'].values)

['tao_flux_absolute',
 'ocs_keo_flux',
 'tao_flux_clim_lwr_relative',
 'tao_flux_clim_lwr_absolute',
 'tao_flux_relative',
 'ocs_papa_flux']

In [6]:
with constants.postgres_engine.connect() as conn:
    df = pd.read_sql("SELECT * from discovery WHERE site_code='Stratus' AND question_id='precip'", con=conn)
df

  site_code question_id               question_title short_string        did
0   Stratus      precip  Stations with Precipitation         RAIN  WHOI_flux

In [9]:
with constants.postgres_engine.connect() as conn:
    df = pd.read_sql("SELECT * from discovery WHERE site_code='0n110w' AND question_id='net_surface_flux'", con=conn)
df

,site_code,question_id,question_title,short_string,did
0,0n110w,net_surface_flux,Stations with Net Surface Heat Flux,QNET,tao_flux_absolute
1,0n110w,net_surface_flux,Stations with Net Surface Heat Flux,QNET,tao_flux_relative